nmaas87/arduino-to-xmc/trunk/hardware/xmc/cores/XMC1300/inc/RTC001/RTC001.h
/*******************************************************************************
**																			  **
**                                                                            **
** Copyright (C) 2011-2013 Infineon Technologies AG. All rights reserved.     **                  
**                                                                            **
** Infineon Technologies AG (Infineon) is supplying this software for use     **
** with Infineon's microcontrollers.                                          **
** This file can be freely distributed within development tools that are      ** 
** supporting such microcontrollers.                                          **
**                                                                            **
** THIS SOFTWARE IS PROVIDED "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED **
** OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF         ** 
** MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS         ** 
** SOFTWARE. INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR          ** 
** SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.  **
**                                                                            ** 
********************************************************************************
**                                                                            **
**                                                                            **
** PLATFORM : Infineon XMC4000/XMC1000 Series                                 **
**                                                                            **
** COMPILER : Compiler Independent                                            **
**                                                                            **
** AUTHOR   : App Developer                                                   **
**                                                                            **
** NOTE     : Any Changes made to this file will be overwritten during Code   **
**            Generation                                                      **
**                                                                            **
**                                                                            **
*******************************************************************************/

/*******************************************************************************
** Version History:                                                           **
********************************************************************************
** v1.0.22    23 Feb 2013  JP: Ported for XMC4400 and XMC1000 Devices.        **
**                            Conditional consumption of NVIC_SCU,NVIC_SR101  **
**                            Apps based on the device.                       ** 
**                                                                            **
** v1.0.24    20 Mar 2013  JP: Mirror register status check                   **
**                            statements under the functions RTC001_Disable(),**
**                            RTC001_ConfigAlarm() and RTC001_Clock_SetTime() ** 
**                            are maintained uniquely for both XMC4000 and    ** 
**                            XMC1000 devices. DBG002 related bugs(ID22796)   ** 
**                            are fixed. Revision History added.              **
**                                                                            **
** v1.0.26    23 Apr 2013  JP: In Function RTC001_ldatevalid(uint16_t m,      **
**                            uint16_t d,uint16_t y), "Day (d) == 0" is       ** 
**                            checked.                                        **
**                                                                            **
** v1.0.28    09 Sep 2013  JP: XMC1000 Five new SW IDs are supported.         **
**                            RTC001 --> wrong handling of Hibernate register **  
**                            is fixed.                                       **
**                                                                            **
** v1.0.30    16 Oct 2013  JP: Code has been updated in compliant to          **
**                            coding guidelines.                              **                                                                           
**                                                                            **
**                                                                            **
**                                                                            **
**                                                                            **
*******************************************************************************/ 
/**
 * @file RTC001.h
 * 
 *
 * @brief  Real Time Clock App implementation header file.
 *
 */

#ifndef RTC001_H_
#define RTC001_H_

#ifdef __cplusplus
extern "C" {
#endif

/*******************************************************************************
** Include Files:                                                             **
*******************************************************************************/
#include "stdint.h"
#include <uc_id.h>

#if defined (__GNUC__)
#include <sys/time.h>
#elif defined(__TASKING__)
#include <time.h>
#endif

#if (__TARGET_DEVICE__ == XMC45)
#include <XMC4500.h>
#elif (__TARGET_DEVICE__ == XMC44)
#include <XMC4400.h>
#elif (__TARGET_DEVICE__ == XMC42)
#include <XMC4200.h>
#elif (__TARGET_DEVICE__ == XMC11)
#include <XMC1100.h>
#elif (__TARGET_DEVICE__ == XMC12)
#include <XMC1200.h>
#elif (__TARGET_DEVICE__ == XMC13)
#include <XMC1300.h>
#else
#error "Unsupported XMC family"
#endif





/*******************************************************************************
** Global Macro Definitions:                                                  **
*******************************************************************************/


