nmaas87/arduino-to-xmc/trunk/hardware/xmc/cores/XMC1300/inc/RTC001/RTC001.h
#define RTC001App_SUCCESS  0U
#define RTC001App_FAIL  1U

/*******************************************************************************
** Global Type Definitions:                                                   **
*******************************************************************************/
/**
 * @ingroup RTC001_enumerations
 * @{
 */
/**
 * This enumeration defines RTC001 App error and status values.
 */

typedef enum RTC001_ErrorType
{
/**
  * @cond INTERNAL_DOCS
  * @param MODULENAME RTC001
  * @endcond
  */
/**
  * Invalid handle or parameter
  */
/**
  * @cond INTERNAL_DOCS
  * @param ERRCODESTRING1 RTC001_INVALID_HANDLE
  * @param STRCODESTRING1 Invalid Handle or Parameter
  * @endcond
  */

  RTC001_INVALID_HANDLE = 1U,
/**
  * Undefined Error
  */
/**
  * @cond INTERNAL_DOCS
  * @param ERRCODESTRING2 RTC001_ERROR
  * @param STRCODESTRING2 Undefined Error
  * @endcond
  */
  RTC001_ERROR = 2U,
/**
  * Flag is set
  */  
/**
  * @cond INTERNAL_DOCS
  * @param ERRCODESTRING2 RTC001_SET
  * @param STRCODESTRING2 Flag is Set
  * @endcond
  */
  RTC001_SET = 3U,
/**
  * @cond INTERNAL_DOCS
  * @param ERRCODESTRING2 RTC001_RESET
  * @param STRCODESTRING2 Flag is Reset
  * @endcond
  */
/**
  * Flag is reset
  */  
  RTC001_RESET = 4U,
/**
  * @cond INTERNAL_DOCS
  * @param ERRCODESTRING2 RTC001_FUNCTION_ENTRY
  * @param STRCODESTRING2 Entered function \%s
  * @endcond
  */
  RTC001_FUNCTION_ENTRY = 5U,
/**
  * @cond INTERNAL_DOCS
  * @param ERRCODESTRING3 RTC001_FUNCTION_EXIT
  * @param STRCODESTRING3 Exited function \%s
  * @endcond
  */
  RTC001_FUNCTION_EXIT = 6U
}RTC001_ErrorType;

/**
 * The below set of flags are used to indicate RTC module's
 * Alarm and Periodic Timer event status. They can be
 * used while clearing the status as well.
 */

typedef enum RTC001_FlagType
{
  /** The Seconds flag in RTC */
  SECONDS_FLAG = 0x1U,
  /** The Minutes flag in RTC */
  MINUTES_FLAG = 0x2U,
  /** The Hours flag in RTC */
  HOURS_FLAG = 0x4U,
  /** The Days flag in RTC */
  DAYS_FLAG = 0x8U,
  /** The Months flag in RTC */
  MONTHS_FLAG = 0x20U,
  /** The Years flag in RTC */
  YEARS_FLAG = 0x40U,
  /** The Alarm flag in RTC */
  ALARM_FLAG = 0x100U
}RTC001_FlagType;


/**
 * This enumeration defines RTC001 Module Enable and Disable values.
 */

typedef enum RTC001_EnableType
{
  /** Disable */
  RTC001_DISABLE = 0x0U,
  /** Enable */
  RTC001_ENABLE = 0x1U
}RTC001_EnableType;


/**
 * This enumeration defines RTC001 Module Initialize Once Enable and Disable
 * values.
 */

typedef enum RTC001_InitOnceType
{
  /** Disable */
  RTC001_INITONCE_DISABLE = 0x0U,
  /** Enable */
  RTC001_INITONCE_ENABLE = 0x1U
}RTC001_InitOnceType;

/**
 * This enumeration defines RTC001 Module Interrupt Related Events Enable and 
 * Disable values.
 */

typedef enum RTC001_InterruptEnableType
{
   /** Event Trigger to SCU for Timer Enable */
  RTC001_EVENTTRIGSCU_TIMER_ENABLE = 0x0U,  
  /** Event Trigger to NMI for Timer Enable */
  RTC001_EVENTTRIGNMI_TIMER_ENABLE = 0x1U,
  /** Event Trigger to SCU for Alarm Enable */
  RTC001_EVENTTRIGSCU_ALARM_ENABLE = 0x0U, 
  /** Event Trigger to NMI for Alarm Enable */
  RTC001_EVENTTRIGNMI_ALARM_ENABLE = 0x1U,
  /** Timer Periodic Seconds Interrupt Disable */
  RTC001_PERIODICSECINT_DISABLE = 0x0U,
  /** Timer Periodic Seconds Interrupt Enable */
  RTC001_PERIODICSECINT_ENABLE = 0x1U,
  /** Timer Periodic Minutes Interrupt Disable */
  RTC001_PERIODICMININT_DISABLE = 0x0U,
  /** Timer Periodic Minutes Interrupt Enable */
  RTC001_PERIODICMININT_ENABLE = 0x1U,
  /** Timer Periodic Hours Interrupt Disable */
  RTC001_PERIODICHOURINT_DISABLE = 0x0U,
  /** Timer Periodic Hours Interrupt Enable */
  RTC001_PERIODICHOURINT_ENABLE = 0x1U,
  /** Timer Periodic Days Interrupt Disable */
  RTC001_PERIODICDAYINT_DISABLE = 0x0U,
  /** Timer Periodic Days Interrupt Enable */
  RTC001_PERIODICDAYINT_ENABLE = 0x1U,
  /** Timer Periodic Month Interrupt Disable */
  RTC001_PERIODICMONTHINT_DISABLE = 0x0U,
  /** Timer Periodic Month Interrupt Enable */
  RTC001_PERIODICMONTHINT_ENABLE = 0x1U,
  /** Timer Periodic Years Interrupt Disable */
  RTC001_PERIODICYEARINT_DISABLE = 0x0U,
  /** Timer Periodic Years Interrupt Enable */
  RTC001_PERIODICYEARINT_ENABLE = 0x1U,
  /** Alarm Interrupt Disable */
  RTC001_ALARMINT_DISABLE = 0x0U,
  /** Alarm Interrupt Enable */
  RTC001_ALARMINT_ENABLE = 0x1U
}RTC001_InterruptEnableType;


/**
 * This enumeration defines RTC001 Module Hibernate Mode Events Enable and 
 * Disable values.
 */

typedef enum RTC001_HibernateModeEventEnableType
{
  /** Alarm Event in Hibernate Mode Disable */
  RTC001_HIBALARM_DISABLE = 0x0U,
  /** Alarm Event in Hibernate Mode Enable */
  RTC001_HIBALARM_ENABLE = 0x1U,
  /** Periodic Seconds Event in Hibernate Mode Disable */
  RTC001_HIBPERIODICSEC_DISABLE = 0x0U,
  /** Periodic Seconds Event in Hibernate Mode Enable */
  RTC001_HIBPERIODICSEC_ENABLE = 0x1U,
  /** Periodic Minutes Event in Hibernate Mode Disable */
  RTC001_HIBPERIODICMIN_DISABLE = 0x0U,
  /** Periodic Minutes Event in Hibernate Mode Enable */
  RTC001_HIBPERIODICMIN_ENABLE = 0x1U,
  /** Periodic Minutes Event in Hibernate Mode Disable */
  RTC001_HIBPERIODICHOUR_DISABLE = 0x0U,
  /** Periodic Minutes Event in Hibernate Mode Enable */
  RTC001_HIBPERIODICHOUR_ENABLE = 0x1U,
  /** Periodic Days Event in Hibernate Mode Disable */
  RTC001_HIBPERIODICDAY_DISABLE = 0x0U,
  /** Periodic Days Event in Hibernate Mode Enable */
  RTC001_HIBPERIODICDAY_ENABLE = 0x1U,
  /** Periodic Months Event in Hibernate Mode Disable */
  RTC001_HIBPERIODICMONTH_DISABLE = 0x0U,
  /** Periodic Months Event in Hibernate Mode Enable */
  RTC001_HIBPERIODICMONTH_ENABLE = 0x1U,
  /** Periodic Months Event in Hibernate Mode Disable */
  RTC001_HIBPERIODICYEAR_DISABLE = 0x0U,
  /** Periodic Months Event in Hibernate Mode Enable */
  RTC001_HIBPERIODICYEAR_ENABLE = 0x1U
}RTC001_HibernateEventModeEnableType;

/**
 *@}
 */

 /**
 * Type of Call back function for Alarm Event.
 * A uint32_t argument can be optionally used.
 */
typedef void (*AlarmCallBackPtr)(uint32_t CbArg);

/**
 * Type of Call back function for Periodic Timer Event.
 * A uint32_t argument can be optionally used.
 *
 */
typedef void (*RTC001_TimerCallBackPtr)(uint32_t CbArg);

/**
  * @ingroup RTC001_datastructures
  * @{
  */

/**
 * Structure for RTC Time configuration.
 */
typedef struct RTC001_TimeHandle
{
  /* Time value to be entered in seconds field */
  uint8_t Sec;
  /* Time value to be entered in minutes field */
  uint8_t Min;
  /* Time value to be entered in hours field */
  uint8_t Hours;
  /* Time value to be entered in days field */
  uint8_t Days;
  /* Time value to be entered in days of week field */
  uint8_t DaWe;
  /* Time value to be entered in months field */
  uint8_t Month;
  /* Time value to be entered in years field */
  uint16_t Year;
}RTC001_TimeHandle;


/**
* RTC001 App Handle structure. Stores a few parameters configured in App UI.
 */

