nmaas87/arduino-to-xmc/trunk/hardware/xmc/cores/XMC1300/inc/RTC001/RTC001.h
typedef struct  RTC001_HandleType
{

 /**
  * General Configurations
  */

 /* RTC Enable */
 RTC001_EnableType RTCEnable;

 /* If value of this flag is 1, then RTC time value will be initialized
  * only once even after system reset
  */
 RTC001_InitOnceType RTCInitOnce;

 /* Clock divider value */
 uint16_t DividerValue;

 /**
  * Interrupt Configurations
  */

  /* Timer Event Trigger */
  RTC001_InterruptEnableType RTCEventTrigTimer;

  /* Timer Periodic Seconds Interrupt */
  RTC001_InterruptEnableType RTCPeriodicSecInterrupt;

  /* Timer Periodic Minutes Interrupt */
  RTC001_InterruptEnableType RTCPeriodicMinInterrupt;

  /* Timer Periodic Hours Interrupt */
  RTC001_InterruptEnableType RTCPeriodicHourInterrupt;

  /* Timer Periodic Days Interrupt */
  RTC001_InterruptEnableType RTCPeriodicDayInterrupt;

  /* Timer Periodic Months Interrupt */
  RTC001_InterruptEnableType RTCPeriodicMonthInterrupt;

  /* Timer Periodic Years Interrupt */
  RTC001_InterruptEnableType RTCPeriodicYearInterrupt;

  /* Alarm Interrupt */
  RTC001_InterruptEnableType RTCAlarmInterrupt;

  /* Alarm Event Trigger */
  RTC001_InterruptEnableType RTCEventTrigAlarm;


  /**
   * Hibernate Configurations
   */

  /* Alarm Event in Hibernate Mode */
  RTC001_HibernateEventModeEnableType RTCHibAlarmEvent;

  /* Periodic Seconds Event in Hibernate Mode */
  RTC001_HibernateEventModeEnableType RTCHibPeriodicSecEvent;

  /* Periodic Minutes Event in Hibernate Mode */
  RTC001_HibernateEventModeEnableType RTCHibPeriodicMinEvent;

  /* Periodic Hours Event in Hibernate Mode */
  RTC001_HibernateEventModeEnableType RTCHibPeriodicHourEvent;

  /* Periodic Days Event in Hibernate Mode */
  RTC001_HibernateEventModeEnableType RTCHibPeriodicDayEvent;

  /* Periodic Months Event in Hibernate Mode */
  RTC001_HibernateEventModeEnableType RTCHibPeriodicMonthEvent;

  /* Periodic Years Event in Hibernate Mode */
  RTC001_HibernateEventModeEnableType RTCHibPeriodicYearEvent;

  /**
   * Listener functions for RTC Interrupt Events.
   */

  /* Event: Timer Periodic Interrupt */
  RTC001_TimerCallBackPtr RTC001_PI_Listener;
  /* Event: Alarm Interrupt */
  AlarmCallBackPtr RTC001_AI_Listener;
    
}RTC001_HandleType;

/**
 *@}
 */


/*******************************************************************************
** Global Constant Declarations:                                              **
*******************************************************************************/


/*******************************************************************************
** Extern Variables:                                                          **
*******************************************************************************/


/*******************************************************************************
** Function ProtoTypes:                                                       **
*******************************************************************************/
/**
 * @ingroup RTC001_apidoc
 * @{
 */

 /**
 * Initialization function for the App.
 * This function configures the RTC module registers as per options given in 
 * App UI and enables the RTC module.
 *
 * @param[in]  None<BR>
 *
 * @return     void
 *
 * <b>Reentrant: NO </b><BR>
 * <BR><P ALIGN="LEFT"><B>Example:</B>
 * @code
 *  #include <DAVE3.h>
 *  int main(void)
 *  {
 *    // Initialize Apps
 *    DAVE_Init(); // RTC001_Init() will be called within DAVE_Init()
 *    // ... infinite loop ...
 *    while(1)
 *    {}
 *  }
 * @endcode<BR> </p> 
 */
void  RTC001_Init(void);


 /**
 * Deinitialization function for the app. 
 *
 * @param[in]  None<BR>
 * @return     void
 *
 * <b>Reentrant: NO </b><BR>
 * <BR><P ALIGN="LEFT"><B>Example:</B>
 * @code
 *  #include <DAVE3.h>
 *  int main(void)
 *  {
 *    // Initialize Apps
 *    DAVE_Init(); // RTC001_Init() will be called within DAVE_Init()
 *    RTC001_DeInit();
 *    // ... infinite loop ...
 *    while(1)
 *    {}
 *  }
 * @endcode<BR> </p> 
 */
void  RTC001_DeInit(void);


 /**
 * This function enables the RTC module. It may be called 
 * if the RTC module is disabled previously.
 *
 * Note : This function is not required after Initialization if the RTC Enable 
 *        UI option is checked. 
 *
 * @param[in]  void<BR>
 *
 * @return     uint32_t<BR>
 *             RTC001App_SUCCESS : for success <br>
 *             RTC001_ERROR  	 : for failure case <br>
 *
 * <b>Reentrant: NO </b><BR>
 * <BR><P ALIGN="LEFT"><B>Example:</B>
 * @code 
 *  #include <DAVE3.h>
 *  int main(void)
 *  {
 *    // Initialize Apps
 *    DAVE_Init(); // RTC001_Init() will be called within DAVE_Init()
 *    RTC001_Enable();
 *    // ... infinite loop ...
 *    while(1)
 *    {}
 *  }
 * @endcode<BR> </p> 
 */
uint32_t  RTC001_Enable(void);


 /**
 * This function disables the RTC Module.
 * Time and Alarm registers are cleared. Can be used to Disable RTC module 
 * before configuring RTC Time.
 *
 * @param[in]  void<BR>
 *
 * @return     uint32_t<BR>
 *             RTC001App_SUCCESS : If Disable successful <br>
 *             RTC001_ERROR  	 : If any error during Disable <br>
 *
 *
 * <b>Reentrant: NO </b><BR>
 * <BR><P ALIGN="LEFT"><B>Example:</B>
 * @code 
 *  #include <DAVE3.h>
 *  int main(void)
 *  {
 *    // Initialize Apps
 *    DAVE_Init(); // RTC001_Init() will be called within DAVE_Init()
 *    RTC001_Disable();
 *    // ... infinite loop ...
 *    while(1)
 *    {}
 *  }
 * @endcode<BR> </p> 
 */
uint32_t  RTC001_Disable(void);


 /**
 * This function clears the given RTC flag.
 * 
 * @param[in]  Flag Indicates which flag to clear. Use the symbolic constants 
 *             enumerated by RTC001_FlagType<BR>
 * 
 * @return     void<BR>
 *
 *
 * <b>Reentrant: NO </b><BR>
 * <BR><P ALIGN="LEFT"><B>Example:</B>
 * @code 
 *  #include <DAVE3.h>
 *  int main(void)
 *  {
 *    // Initialize Apps
 *    DAVE_Init(); // RTC001_Init() will be called within DAVE_Init()
 *    RTC001_Enable();
 *    while(!RTC001_GetFlagStatus(HOURS_FLAG))
 *    {
 *      // Hour event happened
 *      RTC001_ClearFlagStatus(HOURS_FLAG);
 *    }
 *    // ... infinite loop ...
 *    while(1)
 *    {}
 *  }
 * @endcode<BR> </p> 
 */
void  RTC001_ClearFlagStatus(RTC001_FlagType Flag);


 /**
 * Get the status of specified flag.
 *
 * @param[in]  Flag Indicates which Flag to be checked. Use the symbolic 
 *             constants enumerated by RTC001_FlagType<BR>
 *
 * @return     uint32_t <BR>
 *             RTC001_SET	    : Flag is set <br>
 *             RTC001_RESET  	: Flag is reset <br>
 *
 *
 * <b>Reentrant: NO </b><BR>
 * <BR><P ALIGN="LEFT"><B>Example:</B>
 * @code 
 * #include <DAVE3.h>
 * int main(void)
 * {
 *   // Initialize Apps
 *   DAVE_Init(); // RTC001_Init() will be called within DAVE_Init()
 *   RTC001_Enable();
 *   while(!RTC001_GetFlagStatus(HOURS_FLAG))
 *   {
 *     // Hour event happened
 *     RTC001_ClearFlagStatus(HOURS_FLAG);
 *   }
 *   // ... infinite loop ...
 *   while(1)
 *   {}
 * }
 * @endcode<BR> </p> 
 */
uint32_t  RTC001_GetFlagStatus(RTC001_FlagType Flag);


/**
 * This function configures the RTC001 Alarm.
 * If the Alarm Event interrupt is connected to SCU, then optionally a call
 * back function can be registered for the interrupt.
 *
 * @param[in] Handle of type RTC001_HandleType<BR>
 * @param[in] timeptr Pointer to structure which contains Alarm Time <BR>
 *           
 * @param[in] CallBack Alarm event call back function.
 *            If the Alarm Event is connected to SCU, the call back will be 
 *            registered with NVIC_SCU001 app.
 *            If NULL is given, then call back is not registered<BR>
 * @param[in] CbArg(Optional)argument to be passed to the call back function<BR>
 *
 * @return     uint32_t<BR>
 *             RTC001App_SUCCESS    : If Alarm configuration is successful<br>
 *             RTC001_INVALID_HANDLE: If any of the parameter is invalid<br>
 *             RTC001_ERROR       : If any error during Alarm configuration<br>
 *
 * <b>Reentrant: NO </b><BR>
 * <BR><P ALIGN="LEFT"><B>Example:</B>
 * @code 
 * #include <DAVE3.h>
 * static volatile bool AlarmEvent;
 * void Alarm_CallBack(uint32_t Temp)
 * {
 *   AlarmEvent = TRUE;
 * }
 * int main(void)
 * {
 *   uint32_t Status;
 *   RTC001_TimeHandle Alarm_Time;
 *    // ... Initializes Apps ...
 *   DAVE_Init();
 *   Alarm_Time.Sec = 32;
 *   Alarm_Time.Min = 30;
 *   Alarm_Time.Hours = 4;
 *   Alarm_Time.Days = 15;
 *   Alarm_Time.Month = 5;
 *   Alarm_Time.Year = 2012;
 *   Status = RTC001_ConfigAlarm(&RTC001_Handle,&Alarm_Time,Alarm_CallBack,0);
 *   if(Status == DAVEApp_SUCCESS)
 *   {
 *     //Alarm is created successfully
 *   }
 *   // ... infinite loop ...
 *   while(1)
 *   {}
 * }
 * @endcode<BR> </p> 
 */
uint32_t RTC001_ConfigAlarm (const RTC001_HandleType* Handle,
    RTC001_TimeHandle* timeptr, AlarmCallBackPtr CallBack,uint32_t CbArg);

/**
 * This function gets the current time from RTC.
 *
 * @param[in] timeptr Pointer to structure in which current time is returned<BR>
 * @return     uint32_t<BR>
 *             RTC001App_SUCCESS : If RTC time is read successfully<br>
 *             RTC001_ERROR      : If any error during reading<br>
 *
 * <b>Reentrant: NO </b><BR>
 * <BR><P ALIGN="LEFT"><B>Example:</B>
 * @code 
 * #include <DAVE3.h>
 * int main(void)
 * {
 *   RTC001_TimeHandle CurrentTime;
 *   // Initialize Apps
 *   DAVE_Init(); // RTC001_Init() will be called within DAVE_Init()
 *   RTC001_Enable();
 *   while(!RTC001_GetFlagStatus(HOURS_FLAG))
 *   {
 *     // Read current time
 *     RTC001_Clock_GetTime(&CurrentTime);
 *   }
 *   // ... infinite loop ...
 *   while(1)
 *   {}
 * }
 * @endcode<BR> </p> 
 */
uint32_t RTC001_Clock_GetTime (RTC001_TimeHandle* timeptr);

/**
 * This function sets the RTC time. It is recommended to Disable RTC module 
 * before using this function.
 *
 * @param[in] timeptr Pointer to structure which contains time 
 * 					  values to be configured<BR>
 * @return     uint32_t<BR>
 *             RTC001App_SUCCESS: If the RTC time is successfully configured<br>
 *             RTC001_ERROR     : If any error during reading the time<br>
 *
 * <b>Reentrant: NO </b><BR>
 * <BR><P ALIGN="LEFT"><B>Example:</B>
 * @code 
 * #include <DAVE3.h>
 * int main(void)
 * {
 *   RTC001_TimeHandle SetTime;
 *   uint32_t Status;
 *   // Initialize Apps
 *   DAVE_Init(); // RTC001_Init() will be called within DAVE_Init()
 *   RTC001_Disable();
 *   SetTime.Sec = 32;
 *   SetTime.Min = 30;
 *   SetTime.Hours = 4;
 *   SetTime.Days = 15;
 *   SetTime.Month = 5;
 *   SetTime.Year = 2012;
 *   Status = RTC001_Clock_SetTime(&SetTime);
 *   if(Status == DAVEApp_SUCCESS)
 *   {
 *     //Success
 *   }
 *   RTC001_Enable();
 *   // ... infinite loop ...
 *   while(1)
 *   {}
 * }
 * @endcode<BR> </p> 
 */
uint32_t RTC001_Clock_SetTime(RTC001_TimeHandle* timeptr);


/**
 * This function returns the time in seconds since the epoch time(01/01/1970).
 * @param[in] time_value Pointer to an object of type time_t, 
 *            for returning the time.<BR>
 *
 * 
 * @return     uint32_t<BR>
 *             RTC001App_SUCCESS : if time value is calculated successfully<br>
 *             RTC001_ERROR      : If any error<br>
 *                 
 *
 * <b>Reentrant: NO </b><BR>
 * <BR><P ALIGN="LEFT"><B>Example:</B>
 * @code 
 * #include <DAVE3.h>
 * int main(void)
 * {
 *   status_t status = RTC001_ERROR;
 *   time_t Time_Sec;
 *   // ... Initializes Apps ...
 *   DAVE_Init();
 *   status = RTC001_Time(&Time_Sec);
 *   if(status != DAVEApp_SUCCESS)
 *   {
 *	   //error
 *   }
 *   RTC001_Disable();
 *   // ... infinite loop ...
 *   while(1)
 *   {}
 * }
 * @endcode<BR> </p> 
 */
uint32_t RTC001_Time(time_t* time_value) ;

  
/**
 *@}
 */



/** Include App extern file */
#ifdef DAVE_CE
#include "../../inc/RTC001/RTC001_Extern.h"
#endif

#ifdef __cplusplus
}
#endif

#endif /* RTC001_H_ */


